<template>

<div class="about">
  <q-card>
    <q-card-section>
      <p class="text-h6">Про проєкт</p>
    </q-card-section>
    <q-separator/>
    <q-card-section>
      <p>Україна та Сакартвело (на території колишнього ссср цю країну все ще офіційно називають Грузією) це дві держави, які мають чимось схожу історію. За останні десятиліття наші народи стали ближчими один з одним, ріднішими.</p>
      <p>Але так історично склалося, що в більшості випадків для комунікації ми використовуємо російську. І причина доволі сумна: немає (або я погано шукав) нормальних матеріалів таких як підручник, посібник з картвельської мови українською. Є словник в трьох томах, але з великою кількістю помилок в українських словах (все ж краще, ніж нічого). Та є матеріали ентузіастів, які інвестують свій час, енергію та ресурси у вирішення даної проблеми.</p>
      <p>Тож, було прийнято рішення зайнятися розробкою даного проекту, систематизувавши, доповнивши та змінившии існуючий матеріал з даної тематики. Результатом роботи є даний сайт.</p>
      <p>Якщо Ви бажаєте стати частиною цього, зв'яжіться зі мною.</p>

      <vContacts :language="language" :widthLogoBox="'6px'"></vContacts>
    </q-card-section>
  </q-card>
</div>

</template>

<script>
import dictionaryModal from 'src/helpers/dictionary/modals';
import vContacts from 'src/components/vContacts.vue';

  export default {
    name: 'vAbout',
    components: {
      vContacts,
    },
    data() {
      return {
        language: 'ua',
        dictionaryModal,
      }
    }

  }
</script>
